<?php
return [
'IMPORTANTLINKS' =>'روابط مهمة',
'Privacy & Policy' =>'سياسة الاستخدام',
'Terms & Conditions' =>'سياسة الخصوصية',
'VPSHosting' =>'VPS استضافة سيرفرات',
'Support' =>'الدعم الفني',
'Products' =>'خدماتنا',
'Web Hosting' =>'استضافة',
'Reseler Hosting' =>'موزع مساحة',
'Wordpress Hosting' =>'استضافة ووردبرس ',
'Contact Us' =>'اتصل بنا',
'+972598663901' =>'972598663901+',
'callus' =>'اتصل بنا',
'info@gmail.com' =>'info@gmail.com',
'London, UK' =>'غزة',
'Payment' =>'الدفع',
'ABOUT' =>'بال قول هي شركة تعمل في مجال تكنولوجيا المعلومات والدعاية والإعلان والتدريب والاستشارات بمستوي عال وبمساهمة مجموعة من المختصين في شتى المجالات. حيث تسعى إلى مواكبة التطور و توفير أفضل الخدمات بجودة عالية'
];