<?php
return [
'IMPORTANTLINKS' =>'روابط مهمة',
'Privacy & Policy' =>'سياسة الاستخدام',
'Terms & Conditions' =>'سياسة الخصوصية',
'VPSHosting' =>'VPS استضافة سيرفرات',
'Support' =>'الدعم الفني',
'Products' =>'خدماتنا',
'Web Hosting' =>'استضافة',
'Reseler Hosting' =>'موزع مساحة',
'Wordpress Hosting' =>'استضافة ووردبرس ',
'Contact Us' =>'اتصل بنا',
'+972598663901' =>'972598663901+',
'callus' =>'اتصل بنا',
'info@gmail.com' =>'info@gmail.com',
'London, UK' =>'غزة',
'Payment' =>'الدفع',
'ABOUT' =>'شركة بال قول هي شركة فلسطينية تعمل في مجال تكنولوجيا المعلومات والدعاية والإعلان والتدريب والاستشارات بمستوي عال وبمساهمة مجموعة من المتخصصين في التكنولوجيا وفي الدعاية والإعلان والتدريب تسعي إلي توفير أفضل الخدمات بجودة عالية ومواكبة التطور'
];