<?php

use Illuminate\Database\Seeder;

class PostTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->insert([ 
            'Title_ar' => "اسئلة تدور في ذهنك عند استضافة موقعك",
            'Title_en' => "",
            'Auther_ar' => "الدعم الفني لشركة بال قول ",
            'Auther_en' => "",
            'Body_ar' => '<p style="text-align:right"><span dir="rtl" lang="ar">جميعنا يتسأل عن بعد الاسئلة التي تدور في ذهن الشخص عند استضافة موقع له وهي الاساسيات في استضافة مواقع الانترنت فلنتعرف عليها معأ</span></p>

            <p>&nbsp;</p>
            
            <p><span dir="rtl" lang="ar">ما هي الاستضافة؟</span></p>
            
            <p><span dir="rtl" lang="ar">الاستضافة هي المساحة التي تستأجرها من هارديسك السيرفر (كمبيوتر ذو امكانيات ومواصفات خاصة متصل بالانترنت 24 ساعة) لوضع عليها صفحات موقعك والملفات الخاصة بموقعك مثل الصور و والفيديو وغيرها, وذلك لكي يكون موقعك متصل بالانترنت دائما وعندما يرغب اي زائر في اي مكان بالعالم في زيارة موقعك يجده موجود ويستطيع تصفحه بكل سهولة دون اي تدخل منك, وغالبا تكون هذه المساحة بالميجا بايت او بالجيجا بايت.</span></p>
            
            <p>&nbsp;</p>
            
            <p><span dir="rtl" lang="ar">ما هو الترفك او الباندويث؟</span></p>
            
            <p><span dir="rtl" lang="ar">الترافيك او الباندويدث هو كمية نقل البيانات الشهرية من والى الموقع, التي يتم استهلاكها من تحميل او رفع الصور والفيديو الى موقعك او دخول الزوار الى موقعك وتحميل او تصفح هذه الصور والفيديو. مثال: اذا لديك صفحة على الانترنت وقمت برفع 10 صور في هذه الصفحة وكل صورة حجمها 1 ميجا بايت اذن انت استهلكت من الترافيك الشهري الخاص بك 10 ميجا بايت, واذا دخل زائر على هذه الصفحة ليتصفحها فانه يستهلك ايضا 10 ميجا بايت من رصيد الترافيك الشهري الخاص بموقعك وهكذا.</span></p>
            
            <p>&nbsp;</p>
            
            <p><span dir="rtl" lang="ar">ما المقصود بجميع الخواص غير محدودة؟</span></p>
            
            <p><span dir="rtl" lang="ar">أي أنك تستطيع انشاء عدد غير محدود من قواعد البيانات وحسابات البريد وحسابات اف تي بي والنطاقات الفرعية</span></p>
            
            <p><span dir="rtl" lang="ar">ما المقصود بعدد غير محدود من قواعد البيانات؟</span></p>
            
            <p><span dir="rtl" lang="ar">احيانا بعض الاسكربتات او البرامج التي تعمل على الموقع تحتاج الى انشاء قاعدة بيانات لها لكي تعمل, ونحن في استضافة ندى هوست نوفر لكم عدد غير محدود من قواعد البيانات التي يمكن انشائها مع اي خطة استضافة, اى انه يمكنك تركيب عدد لا نهائي من الاسكربات والبرامج على موقعك.</span></p>
            
            <p>&nbsp;</p>
            
            <p><span dir="rtl" lang="ar">ما المقصود بعدد غير محدود من حسابات البريد الالكتروني؟</span></p>
            
            <p><span dir="rtl" lang="ar">اي انك تستطيع عمل عدد لا نهائي من حسابات البريد الرسمية التي تكون مرتبطة باسم موقعك. مثل sales@yoursite.com, ahmed@yoursite.com</span></p>
            
            <p>&nbsp;</p>
            
            <p><span dir="rtl" lang="ar">ما هي لوحة التحكم cpanel ؟</span></p>
            
            <p><span dir="rtl" lang="ar">هي لوحة تحكم تحتوي علي كل المميزات التي تساعدك علي ادارة الاستضافة و من مميزاتها دعم اللغة العربية وسهولة التعامل معها لذلك يفضلها الكثير من اصحاب و مديري المواقع بالاضافة الي الخصائص الاخري مثل رفع ملفات موقعك ومعرفة المساحة و الترافيك المستخدمة وكذلك اضافة وحذف دومينات فرعية ودومينات اضافية ودومينات التي توجهها وقواعد البيانات والكثير من المميزات.</span></p>
            
            <p><span dir="rtl" lang="ar">هذه جميعها مطلوبة لكي تتمكن من استضافة موقع علي الانترنت</span></p>
            
            <p>&nbsp;</p>
            
            <p><span dir="rtl" lang="ar">شركة بال قول وفرت لك جميع الشروحات المستلزمة لاستضافة موقعك الالكتروني لا تتردد الان باضافة تعليقك لكي نجيبك علي كل سؤال خاص بك .</span></p>',
            'Body_en' =>"",
            'image' => "blog2.jpg",
            'slug' => "asel-tdor-fy-thhnk-aand-astdaf-mokaak",
            'created_at' =>'2019-11-05 19:26:52',
        ]);
        DB::table('posts')->insert([ 
            'Title_ar' => "الفرق بين القوالب الإحترافية والمجانية",
            'Title_en' => "",
            'Auther_ar' => "الدعم الفني لشركة بال قول ",
            'Auther_en' => "support palgooal co",
            'Body_ar' => '<p>الكثير من مستعملي نظم إدارة المحتوى&nbsp;يسألون هذا السؤال, فكما يعلم الجميع فأغلب هذه الأنظمة توفر إمكانية تركييب القوالب التي من شأنها تغيير شكل الموقع حسب مختلف الأدواق والمتطلبات,لاكن هذه القوالب تنقسم لنوعين : احترافية ومجانية, فما الفرق بينهما.</p>

            <h3>تعريف القوالب الإحترافية &ldquo;بريميوم&rdquo;</h3>
            
            <p>هذا التعريف هو طبعا حسب تجربتي الشخصية,يمكنني أن أقول أن القوالب الإحترافية هي التي يتم تحميلها واستعمالها بمقابل مادي يحدده المصمم أو المبرمج. كما أن هذه القوالب تتميز بكونها تحتوي على خيارات ومميزات أكثر من المجانية.</p>
            
            <h3>مميزاتها</h3>
            
            <p>تتميز هذه القوالب بالتصميم الجداب والأنيق الذي يحترم معايير التصميم الحديثة.</p>
            
            <p>توفر إمكانية عالية للتحكم في القالب وتخصيصه ليلائم متطلباتك عن طريق لوحة تحكم خاصة.</p>
            
            <p>توفير الدعم الفني, فالبائع أو المتجر الذي اشتريت منه هذه القوالب ,يوفر لك الدعم الفني في حالة واجهتك مشاكل أتناء استخدام القالب.</p>
            
            <p>جودة البرمجة, فكما أن للتصميم معايير جودة فكذالك الأمر بالنسبة للبرمجة,فالبرمجة الإحترافية تجعل القالب يعمل بسلاسة واستقرار وبدون مشاكل.</p>
            
            <p>توفير تحديثات دورية للقالب لإصلاح المشاكل التي يمكن أن تظهر,كذالك إضافة مميزات أخرى.</p>
            
            <h3>القوالب المجانية</h3>
            
            <p>القوالب المجانية هي التي يمكنك استعمالها بشكل مجاني بدون مقابل.</p>
            
            <p>ميزتها أنها مجانية.</p>
            
            <h3>عيوبها</h3>
            
            <p>غياب الدعم الفني, وهذا أمر طبيعي فالمطور لايمكن أن يقدم الدعم الفني مجانا.</p>
            
            <p>إمكانية جد محدودة للتخصيص.</p>
            
            <p>التصميم والبرمجة غالبا ماتكون دات جودة ضعيفة.</p>
            
            <p>التحديثات غالبا لاتتوفر فالمطور يكتفي بإصدار واحد فقط.</p>
            
            <p>في الأخير اختيار القالب يبقى لك , ويتحكم في هذا متطلباتك الخاصة.</p>
            
            <ul>
                <li>&nbsp;</li>
            </ul>',
            'Body_en' =>"",
            'image' => "blog2.jpg",
            'slug' => "alfrk-byn-alkoalb-alehtrafy-oalmjany",
            'created_at' =>'2019-11-05 19:26:52',
        ]);
        DB::table('posts')->insert([ 
            'Title_ar' => "ما هو ترافيك استضافة المواقع",
            'Title_en' => "",
            'Auther_ar' => "الدعم الفني لشركة بال قول ",
            'Auther_en' => "support palgooal co",
            'Body_ar' => '<p><strong>ماهو الباندويث أو الترافيك أو تناقل البيانات؟</strong><br />
            الثلاث مسميات تعنى معنى واحد وسوف نستخدم كلمة الترافيك في استضافة المواقع فهى تعطى معنى أوضح وتعنى كمية الداتا المتبادله بين موقعك وبين أعضاؤه وزواره</p>
            
            <p><strong>&nbsp;كيف تستهلك كمية نقل البيانات الخاصه بموقعى ؟</strong><br />
            نعطى مثال:<br />
            زائر أو عضو دخل موضوع على منتداك هذا الموضوع به صور للشرح قيمتها 1 ميجا وبها صور فى التوقيعات قيمتها 1 ميجا قام هذا العضو بتحميل برنامج موضوع فى المشاركه ( ومحمل على موقعك ) قيمته 2 ميجا ثم قام هذا العضو برفع ملف على موقعك لوضعرابطه بالمشاركه قيمة الملف الذى وضعه 1 ميجا أضافه الى أن عدد حروف الخاصه بالردود فى هذه المشاركه 500 كيلو وصور الاستايل التى ظهرت عند فتح الموضوع تساوى 1 ميجا ( الان قم بجمع كل القيم تجدها تجدها 6.5 ميجا )<br />
            فهذا العضو وحده ومن خلال تصفحه لهذه المشاركه أستهلك من كمية نقل البيانات لموقعك 6.5 ميجا</p>
            
            <p><strong>هل هذا فقط هو مايستهلك كمية تناقل البيانات الخاصه بموقعى؟</strong><br />
            يبقى شىء أخر وهو شيطان أستهلاك كمية تناقل البيانات الخاصه بموقعك وهى اذا قمت بالافراط فى أرسال الرسائل من موقعك ولذلك يجب عليك أن تفعل مايفعله خبراء المواقع عندما يريدون أرسال رسائل ولا يتأثر موقهم هم يستخدمون أحد برامج أرسال الرسائل من أجهزتهم<br />
            <strong>ماهى الطرق لعدم أستهلاك كمية تناقل البيانات لموقعى ؟</strong><br />
            <strong>1 &ndash;</strong>&nbsp;يجب أن تتعمد أختيار تصميم لموقعك بدون أن تبالغ فى قيمة وعدد الصور عليه وأن تقوم بضغط صور تصميم موقعك قبل رفعها لموقعك مستخدمآ أحد برامج ضغط الصور وهذ ه الخطوه تنطبق على أستايل المنتدى وبالمناسبه فأن هاك تصغير الصور ليس له أى تأثير فى خفض أستهلاك كمية تناقل البيانات فقط هو للمحافظه على الشكل العام للمشاركه وفى نفس الموضوع موضوع الصور يجب على الأعضاء والمشرفين بتحميل الصور الخاصه بالشرح والصور الخاصه بتوقيعهم على موقع رفع وتحميل الصور ثم يضعوا الروابط فقط بموقعك ففى هذه الحاله الاستهلاك سيكون على المواقع التى تم تحميل صور الشرح والتوقيع عليها</p>
            
            <p><strong>2 &ndash;</strong>&nbsp;نفس الشى ينطبق على الملفات التى تضعها كابرامج وغير ذلك فلا تقوم بتحميلها على موقعك بل قم بتحميلها على أى موقع تحميل وضع الروابط فقط فى موقعك وبالتالى الاستهلاك سيكون على الموقع الذى تم رفع الملفات عليه وليس على موقعك</p>
            
            <p><strong>3 &ndash;</strong>&nbsp;لا تستخدم موقعك فى أرسال الرسائل بشكل مفرط وأستخدم أحد البرامج التى تقوم بنفس الغرض ولكن من على جهازك<br />
            <strong>فماذا تفسر أعطاؤهم كمية تناقل بيانات مفتوح للموقع المستضافه لديهم وغير محدده ؟</strong></p>
            
            <p>أولآ هو نوع من أنواع الدعايه ليس إلا وفى نفس الوقت أضرار للمواقع المستضافه لديهم وعدم القدره على تحمل مسؤلية المحافظه على المواقع المستضافه لديهم وعلى سبيل المثال<br />
            اذا أعطى كمية تناقل بيانات مفتوحه وهو بالأساس كمية تناقل البيانات بشكل طبيعى محدده على السيرفر فماذا يحدث اذا كان لديه عدد ما من الموقع مستضافه عنده وليكن 100 موقع أو أقل أو أكثر لا فرق ثم ثم أصحاب عشر مواقع أو أقل أو أكثر أتستهلكوا كمية تناقل البيانات الخاصه بالسيرفر ذاته ؟ الأجابه سيتوقف كل المواقع الباقيه بلا أ ذنب ولذلك ولأسباب مبالغة أصحاب شركات الآستضافه فى خداماتهم التى يقدمونها وهى بالأساس غير واقعيه تجد أن هذه الشركات دائمآ تسقط وتغلق ويضيع ماعليها من مواقع</p>
            
            <p><strong>أنهت كمية تناقل البيانات الخاصه بى ماذا أفعل ؟</strong><br />
            أن كمية تناقل البيانات الخاصه بموقعك تتجدد مع بداية كل شهر فإذا أنتهت قبل نهاية الشهر سيغلق موقعك بشكل أتوماتيكيآ ثم يعاود العمل ويفتح بشكل أتوماتيكيآ أيضآ مع بداية الشهر ويجب عليك تنظيم وضبط موقعك حتى لا يغلق مره أخرى بالشهر الذى يليه</p>
            
            <ul>
                <li>&nbsp;</li>
            </ul>',
            'Body_en' =>"",
            'image' => "blog2.jpg",
            'slug' => "ma-ho-trafyk-astdaf-almoakaa",
            'created_at' =>'2019-11-05 19:26:52',
        ]);
    }
}
